#+TITLE: sonoff-diy - Control Sonoff DIY devices
#+PROPERTY: header-args :eval never-export

You can switch the relays, set wifi credentials and flash a new firmware with this tool.

* Usage

#+BEGIN_SRC sh :exports results :results output
sonoff-diy --help
#+END_SRC

#+RESULTS:
#+begin_example
sonoff-diy 0.1.0

USAGE:
    sonoff-diy [FLAGS] <SUBCOMMAND>

FLAGS:
    -d, --debug      enable debug logging
    -h, --help       Prints help information
    -V, --version    Prints version information

SUBCOMMANDS:
    flash     flash the given firmware (--bin) ota
    help      Prints this message or the help of the given subcommand(s)
    info      fetch device infos
    list      List found devices
    scan      Scan devices
    switch    switch on / off
    unlock    unlock the sonoff device to flash it ota
    wifi      set wifi credentials in the sonoff device
#+end_example

